# IdeaStatiCa.RcsApi.Model.StrainLoadOnLine
Linearly distributed generalized strain load along a line.  Strain load is in local coordinate system and there are no possible eccentricities.

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Id** | **int** | Element Id | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)